RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_qspi.c
/***************************************************************************//**
* \file cyhal_qspi.c
*
* Description:
* Provides a high level interface for interacting with the Infineon QSPI (SMIF).
* This is a wrapper around the lower level PDL API.
*
********************************************************************************
* \copyright
* Copyright 2018-2021 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
 * \addtogroup group_hal_impl_qspi QSPI (Quad Serial Peripheral Interface)
 * \ingroup group_hal_impl
 * \{
 * \section section_hal_impl_qspi_init_cfg Configurator-generated features limitations
 * List of SMIF personality items, which are currently not supported in QSPI HAL driver on CAT1A/CAT1B devices:
 *  - XIP (eXecute In Place) mode
 *  - Memory Mode Alignment Error interrupt
 *  - RX Data FIFO Underflow interrupt
 *  - TX Command FIFO Overflow
 *  - TX Data FIFO Overflow interrupt
 *  - RX FIFO Level Trigger interrupt
 *  - TX FIFO Level Trigger interrupt
 *  - RX DMA Trigger
 *  - TX DMA Trigger
 *
 * \section section_hal_impl_qspi_init_clock_20829 20829 device clock limitations
 * Due to specifics of 20829 device clock tree, where multiple peripheral devices are clocked by same HF1, as
 * QSPI HW Block, QSPI HAL driver is not allowed to manipulate frequency by itself. In this case user should allocate
 * and configure their own HF1 clock and pass it as `cyhal_clock_t *clk` parameter into cyhal_qspi_init function.
 *
 * \section section_hal_impl_clock_freq Interface clock frequency
 * Starting MXSMIF HW block version 2 (checked with `CY_IP_MXSMIF_VERSION` define), QSPI interface clock frequency is
 * twice lower than configured source HF clock, so if QSPI source HF clock is configured, for instance, for 50 MHz, connected
 * memory will be accessed on 25 MHz clock. Interface clock frequency of MXSMIF block with version 1 corresponds
 * to frequency of source HF clock.
 *
 * \} group_hal_impl_qspi
 */

#include <string.h>
#include <math.h>
#include <stdlib.h>
#include "cy_smif.h"
#include "cyhal_utils.h"
#include "cyhal_irq_psoc.h"
#include "cyhal_qspi.h"
#include "cyhal_hwmgr.h"
#include "cyhal_gpio.h"
#include "cyhal_interconnect.h"
#include "cyhal_system_impl.h"
#include "cyhal_syspm.h"
#include "cyhal_clock.h"

#if (CYHAL_DRIVER_AVAILABLE_QSPI)

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*******************************************************************************
*       Internal
*******************************************************************************/
/* in microseconds, timeout for all blocking functions */
#define _CYHAL_QSPI_TIMEOUT_10_MS (10000UL)

#define _CYHAL_QSPI_MAX_DATA_PINS 8

#define _CYHAL_QSPI_MAX_RX_COUNT (65536UL)
#define _CYHAL_QSPI_DESELECT_DELAY (7UL)

#if (defined(SMIF_CHIP_TOP_DATA8_PRESENT) && (SMIF_CHIP_TOP_DATA8_PRESENT))   || \
    (defined(SMIF0_CHIP_TOP_DATA8_PRESENT) && (SMIF0_CHIP_TOP_DATA8_PRESENT))
    #define _CYHAL_QSPI_DATA8_PRESENT   1
#else
    #define _CYHAL_QSPI_DATA8_PRESENT   0
#endif
#if (SMIF_CHIP_TOP_SPI_SEL_NR > 1)
    #define _CYHAL_QSPI_SEL1   1
#else
    #define _CYHAL_QSPI_SEL1   0
#endif
#if (SMIF_CHIP_TOP_SPI_SEL_NR > 2)
    #define _CYHAL_QSPI_SEL2   1
#else
    #define _CYHAL_QSPI_SEL2   0
#endif
#if (SMIF_CHIP_TOP_SPI_SEL_NR > 3)
    #define _CYHAL_QSPI_SEL3   1
#else
    #define _CYHAL_QSPI_SEL3   0
#endif

static cyhal_qspi_t *_cyhal_qspi_config_structs[CY_IP_MXSMIF_INSTANCES];

/* List of available QSPI instances */
static SMIF_Type *const _cyhal_qspi_base_addresses[CY_IP_MXSMIF_INSTANCES] =
{
#ifdef SMIF0
    SMIF0,
#endif /* ifdef SMIF0 */
};

#if (CY_IP_MXSMIF_VERSION >= 3)
#define CYHAL_SMIF_IRQN    (smif_interrupt_normal_IRQn)
#elif (CY_IP_MXSMIF_VERSION == 2)
#define CYHAL_SMIF_IRQN    (smif_0_interrupt_IRQn)
#else
#define CYHAL_SMIF_IRQN    (smif_interrupt_IRQn)
#endif

/* List of available QSPI interrupt sources */
static const _cyhal_system_irq_t _CYHAL_QSPI_IRQ_N[CY_IP_MXSMIF_INSTANCES] =
{
#ifdef SMIF0
    CYHAL_SMIF_IRQN,
#endif /* ifdef SMIF0 */
};

static inline uint8_t _cyhal_qspi_get_block_from_irqn(_cyhal_system_irq_t irqn)
{
    switch (irqn)
    {
#if !(CY_CPU_CORTEX_M0P)
#ifdef SMIF0
        case CYHAL_SMIF_IRQN: return 0;
#endif /* ifdef SMIF0 */
#endif /* !(CY_CPU_CORTEX_M0P) */
        default:
            CY_ASSERT(false); // Should never be called with a non-SMIF IRQn
            return 0;
    }
}

static cyhal_qspi_t *_cyhal_qspi_get_irq_obj(void)
{
    _cyhal_system_irq_t irqn = _cyhal_irq_get_active();
    uint8_t block = _cyhal_qspi_get_block_from_irqn(irqn);
    return _cyhal_qspi_config_structs[block];
}

static void _cyhal_qspi_set_pins_frozen(cyhal_qspi_t* obj, bool freeze)
{
    GPIO_PRT_Type* port;
    uint8_t pin;
    cyhal_gpio_t gpio;
    for(size_t i = 0; i < _CYHAL_QSPI_MAX_DATA_PINS; ++i)
    {
        gpio = obj->pin_io[i];
        if(NC != gpio)
        {
            port = CYHAL_GET_PORTADDR(gpio);
            pin = (uint8_t)CYHAL_GET_PIN(gpio);
            if(freeze)
            {
                obj->saved_io_hsiom[i] = Cy_GPIO_GetHSIOM(port, pin);
                Cy_GPIO_Clr(port, pin);
                Cy_GPIO_SetHSIOM(port, pin, HSIOM_SEL_GPIO);
            }
            else
            {
                Cy_GPIO_SetHSIOM(port, pin, obj->saved_io_hsiom[i]);
            }
        }
    }

