RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_qspi.c
    gpio = obj->pin_sclk;
    if(NC != gpio)
    {
        port = CYHAL_GET_PORTADDR(gpio);
        pin = (uint8_t)CYHAL_GET_PIN(gpio);
        if(freeze)
        {
            obj->saved_sclk_hsiom = Cy_GPIO_GetHSIOM(port, pin);
            Cy_GPIO_Clr(port, pin);
            Cy_GPIO_SetHSIOM(port, pin, HSIOM_SEL_GPIO);
        }
        else
        {
            Cy_GPIO_SetHSIOM(port, pin, obj->saved_sclk_hsiom);
        }
    }

    for(size_t i = 0; i < SMIF_CHIP_TOP_SPI_SEL_NR; ++i)
    {
        gpio = obj->pin_ssel[i];
        if(NC != gpio)
        {
            port = CYHAL_GET_PORTADDR(gpio);
            pin = (uint8_t)CYHAL_GET_PIN(gpio);
            if(freeze)
            {
                obj->saved_ssel_hsiom[i] = Cy_GPIO_GetHSIOM(port, pin);
                Cy_GPIO_Set(port, pin); // The SMIF IP requires SSEL to be active low
                Cy_GPIO_SetHSIOM(port, pin, HSIOM_SEL_GPIO);
            }
            else
            {
                Cy_GPIO_SetHSIOM(port, pin, obj->saved_ssel_hsiom[i]);
            }
        }
    }
}

static bool _cyhal_qspi_pm_callback(cyhal_syspm_callback_state_t state, cyhal_syspm_callback_mode_t mode, void* callback_arg)
{
    CY_UNUSED_PARAMETER(state);
    cyhal_qspi_t *obj = (cyhal_qspi_t *)callback_arg;
    bool allow = true;
    switch(mode)
    {
        case CYHAL_SYSPM_CHECK_READY:
            allow &= obj->context.txBufferCounter == 0;
            allow &= obj->context.rxBufferCounter == 0;
            allow &= Cy_SMIF_GetRxFifoStatus(obj->base) == 0;
            allow &= Cy_SMIF_GetTxFifoStatus(obj->base) == 0;
            if (allow)
            {
                obj->pm_transition_pending = true;
            }
            break;
        case CYHAL_SYSPM_BEFORE_TRANSITION:
            _cyhal_qspi_set_pins_frozen(obj, true);
            break;
        case CYHAL_SYSPM_AFTER_TRANSITION:
            _cyhal_qspi_set_pins_frozen(obj, false);
            obj->pm_transition_pending = false;
            break;
        case CYHAL_SYSPM_CHECK_FAIL:
            obj->pm_transition_pending = false;
            break;
        default:
            CY_ASSERT(false);
            break;
    }
    return allow;
}

/*******************************************************************************
*       Dispatcher Interrupt Service Routine
*******************************************************************************/

/* The PDL can deassert the IRQ status during Cy_SMIF_Interrupt which prevents _cyhal_qspi_get_irq_obj()
 * from working properly in _cyhal_qspi_cb_wrapper on devices with muxed IRQs, because they can't tell
 * at that point which system IRQ caused the CPU IRQ. So we need to save this value at the beginning of the
 * IRQ handler when we are able to determine what it is */
static volatile cyhal_qspi_t* _cyhal_qspi_irq_obj = NULL;

static void _cyhal_qspi_cb_wrapper(uint32_t event)
{
    cyhal_qspi_event_t hal_event = CYHAL_QSPI_EVENT_NONE;
    if (event == CY_SMIF_SEND_CMPLT)
        hal_event = CYHAL_QSPI_IRQ_TRANSMIT_DONE;
    else if (event == CY_SMIF_REC_CMPLT)
        hal_event = CYHAL_QSPI_IRQ_RECEIVE_DONE;

    cyhal_qspi_t *obj = (cyhal_qspi_t *)_cyhal_qspi_irq_obj;

    if ((obj->irq_cause & (uint32_t)hal_event) > 0) // Make sure a user requested event is set before calling
    {
        cyhal_qspi_event_callback_t callback = (cyhal_qspi_event_callback_t) obj->callback_data.callback;
        callback(obj->callback_data.callback_arg, hal_event);
    }
}

/*******************************************************************************
*       (Internal) Interrupt Service Routines
*******************************************************************************/

/* Interrupt call, needed for SMIF Async operations */
static void _cyhal_qspi_irq_handler(void)
{
    /* Save the old value and store it aftewards in case we get into a nested IRQ situation */
    /* Safe to cast away volatile because we don't expect this pointer to be changed while we're in here, they
     * just might change where the original pointer points */
    cyhal_qspi_t* old_irq_obj = (cyhal_qspi_t*)_cyhal_qspi_irq_obj;
    _cyhal_qspi_irq_obj = (cyhal_qspi_t*) _cyhal_qspi_get_irq_obj();
    cyhal_qspi_t* obj = (cyhal_qspi_t*)_cyhal_qspi_irq_obj;

    Cy_SMIF_Interrupt(obj->base, &(obj->context));

    _cyhal_qspi_irq_obj = old_irq_obj;
}

/*******************************************************************************
*       (Internal) QSPI Pin Related Functions
*******************************************************************************/

/* Check if pin valid as resource and reserve it */
static inline cy_rslt_t _cyhal_qspi_check_pin_and_reserve(const cyhal_resource_pin_mapping_t *mapping, uint8_t drive_mode)
{
    // Mbed calls qspi_init multiple times without calling qspi_free to update the QSPI frequency/mode.
    // As a result, we can't worry about resource reservation if running through mbed.
#ifndef __MBED__
    cy_rslt_t result = _cyhal_utils_reserve_and_connect(mapping, drive_mode);
#else
    cy_rslt_t result = cyhal_connect_pin(mapping, drive_mode);
#endif

    return result;
}

/*******************************************************************************
*       (Internal) QSPI Config Related Functions
*******************************************************************************/

/* Translates HAL bus width to PDL bus width */
static cy_en_smif_txfr_width_t _cyhal_qspi_convert_bus_width(cyhal_qspi_bus_width_t bus_width)
{
    cy_en_smif_txfr_width_t cyhal_bus_width;

    switch (bus_width)
    {
        case CYHAL_QSPI_CFG_BUS_SINGLE:
            cyhal_bus_width = CY_SMIF_WIDTH_SINGLE;
            break;
        case CYHAL_QSPI_CFG_BUS_DUAL:
            cyhal_bus_width = CY_SMIF_WIDTH_DUAL;
            break;
        case CYHAL_QSPI_CFG_BUS_QUAD:
            cyhal_bus_width = CY_SMIF_WIDTH_QUAD;
            break;
        case CYHAL_QSPI_CFG_BUS_OCTAL:
            cyhal_bus_width = CY_SMIF_WIDTH_OCTAL;
            break;
        default:
            cyhal_bus_width = CY_SMIF_WIDTH_SINGLE;
    }

    return cyhal_bus_width;
}

static cy_rslt_t _cyhal_qspi_check_command_struct(const cyhal_qspi_command_t *qspi_command)
{
    #if (CY_IP_MXSMIF_VERSION < 3)
    if (((!qspi_command->instruction.disabled) && (qspi_command->instruction.data_rate == CYHAL_QSPI_DATARATE_DDR)) ||
        ((!qspi_command->address.disabled) && (qspi_command->address.data_rate == CYHAL_QSPI_DATARATE_DDR)) ||
        ((!qspi_command->mode_bits.disabled) && (qspi_command->mode_bits.data_rate == CYHAL_QSPI_DATARATE_DDR)) ||
        ((qspi_command->dummy_cycles.dummy_count != 0) && (qspi_command->dummy_cycles.data_rate == CYHAL_QSPI_DATARATE_DDR)) ||
        (qspi_command->data.data_rate == CYHAL_QSPI_DATARATE_DDR))
    {
        /* DDR datarate is not supported by used SMIF IP block */
        return CYHAL_QSPI_RSLT_ERR_DATARATE;
    }
    if (qspi_command->instruction.two_byte_cmd)
    {
        /* Two byte instuction is not supported on current SMIF IP block */
        return CYHAL_QSPI_RSLT_ERR_INSTRUCTION;
    }
    if ((qspi_command->dummy_cycles.dummy_count != 0) && (qspi_command->dummy_cycles.bus_width != CYHAL_QSPI_CFG_BUS_SINGLE))
    {
        /* Bus width parameter for dummy cycles can only be 'single' for current version of SMIF IP block */
        return CYHAL_QSPI_RSLT_ERR_DUMMY_CYCLES;
    }
    #else /* CY_IP_MXSMIF_VERSION < 3 or other */
    CY_UNUSED_PARAMETER(qspi_command);
    #endif /* CY_IP_MXSMIF_VERSION < 3 or other */
    return CY_RSLT_SUCCESS;
}

static void _cyhal_qspi_uint32_to_byte_array(uint32_t value, uint8_t *byteArray, uint32_t startPos, uint32_t size)
{
    do
    {
        size--;
        byteArray[size + startPos] = (uint8_t)(value & 0xFF);
        value >>= 0x08;
    } while (size > 0);
}

/* cyhal_qspi_size_t to number bytes */
static inline uint32_t _cyhal_qspi_get_size(cyhal_qspi_size_t hal_size)
{
    return ((uint32_t)hal_size >> 3); /* convert bits to bytes */
}

/* Sends QSPI command with certain set of data */
static cy_rslt_t _cyhal_qspi_command_transfer(cyhal_qspi_t *obj, const cyhal_qspi_command_t *command,
    uint32_t addr, bool endOfTransfer)
{
    /* max address size is 4 bytes and max mode bits size is 4 bytes */
    uint8_t cmd_param[8] = {0};
    uint32_t start_pos = 0;
    uint32_t addr_size = 0;
    uint32_t mode_bits_size = 0;
    cy_en_smif_txfr_width_t bus_width = CY_SMIF_WIDTH_SINGLE;
    #if (CY_IP_MXSMIF_VERSION >= 3)
    cy_en_smif_data_rate_t data_rate = CY_SMIF_SDR;
    #endif /* CY_IP_MXSMIF_VERSION >= 3 */

    cy_rslt_t result = _cyhal_qspi_check_command_struct(command);

    if (CY_RSLT_SUCCESS == result)
    {
        /* Does not support different bus_width for address and mode bits.
        * bus_width is selected based on what (address or mode bits) is enabled.
        * If both are enabled, bus_width of mode bits is selected
        * It is either possible to support 1 byte mode bits with different bus_width
        * by sending the mode byte as command as done in Cy_SMIF_Memslot_CmdRead()
        * in cyhal_smif_memslot.c or support multiple bytes of mode bits with same bus_width
        * as address by passing the mode bytes as cmd_param to Cy_SMIF_TransmitCommand().
        * Second approach is implemented here. This restriction is because of the way
        * PDL API is implemented.
        */

        if (!command->address.disabled && !command->mode_bits.disabled)
        {
            if (_cyhal_qspi_convert_bus_width(command->address.bus_width) != _cyhal_qspi_convert_bus_width(command->mode_bits.bus_width))
            {
                result = CYHAL_QSPI_RSLT_ERR_BUS_WIDTH;
            }
            #if (CY_IP_MXSMIF_VERSION >= 3)
            else if (command->address.data_rate != command->mode_bits.data_rate)
            {
                result = CYHAL_QSPI_RSLT_ERR_DATARATE;
            }
            #endif /* CY_IP_MXSMIF_VERSION >= 3 */
        }

        if (CY_RSLT_SUCCESS == result)
        {
            if (!command->address.disabled)
            {
                addr_size = _cyhal_qspi_get_size(command->address.size);
                _cyhal_qspi_uint32_to_byte_array(addr, cmd_param, start_pos, addr_size);
                start_pos += addr_size;
                bus_width = _cyhal_qspi_convert_bus_width(command->address.bus_width);
                #if (CY_IP_MXSMIF_VERSION >= 3)
                data_rate = (cy_en_smif_data_rate_t)command->address.data_rate;
                #endif /* CY_IP_MXSMIF_VERSION >= 3 */
            }

            if (!command->mode_bits.disabled)
            {
                mode_bits_size = _cyhal_qspi_get_size(command->mode_bits.size);
                _cyhal_qspi_uint32_to_byte_array(command->mode_bits.value, cmd_param, start_pos, mode_bits_size);
                bus_width = _cyhal_qspi_convert_bus_width(command->mode_bits.bus_width);
                #if (CY_IP_MXSMIF_VERSION >= 3)
                data_rate = (cy_en_smif_data_rate_t)command->mode_bits.data_rate;
                #endif /* CY_IP_MXSMIF_VERSION >= 3 */
            }

            uint32_t cmpltTxfr = ((endOfTransfer) ? 1UL : 0UL);
            #if (CY_IP_MXSMIF_VERSION < 3)
            result = (cy_rslt_t)Cy_SMIF_TransmitCommand(obj->base, (uint8_t)(command->instruction.value & 0xFF),
                        _cyhal_qspi_convert_bus_width(command->instruction.bus_width), cmd_param,
                        (addr_size + mode_bits_size), bus_width, obj->slave_select, cmpltTxfr, &obj->context);
            #else
            result = (cy_rslt_t)Cy_SMIF_TransmitCommand_Ext(obj->base, command->instruction.value,
                        command->instruction.two_byte_cmd, _cyhal_qspi_convert_bus_width(command->instruction.bus_width),
                        (cy_en_smif_data_rate_t)command->instruction.data_rate, cmd_param, (addr_size + mode_bits_size),
                        bus_width, data_rate, obj->slave_select, cmpltTxfr, &obj->context);
            #endif /* CY_IP_MXSMIF_VERSION < 3 or other */
        }
    }
    return result;
}

static inline cy_en_smif_slave_select_t _cyhal_qspi_slave_idx_to_smif_ss(uint8_t ssel_idx)
{
    return (cy_en_smif_slave_select_t)(1 << ssel_idx);
}

/* Checks, that user provided all needed pins and returns max bus width */
static cy_rslt_t _cyhal_qspi_check_user_pins(const cyhal_qspi_slave_pin_config_t *pin_set, cyhal_qspi_bus_width_t *max_width)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

#if _CYHAL_QSPI_DATA8_PRESENT
    if (NC != pin_set->io[4])
    {
        *max_width = CYHAL_QSPI_CFG_BUS_OCTAL;
    }
    else
#endif
    if (NC != pin_set->io[2])
    {
        *max_width = CYHAL_QSPI_CFG_BUS_QUAD;
    }
    else if (NC != pin_set->io[1])
    {
        *max_width = CYHAL_QSPI_CFG_BUS_DUAL;
    }
    else
    {
        *max_width = CYHAL_QSPI_CFG_BUS_SINGLE;
    }

    for (uint8_t i = 1; i <= _CYHAL_QSPI_MAX_DATA_PINS; i++)
    {
        /* Pins with index lower than width must be provided, pins above should be NC */
        if ((NC == pin_set->io[i-1]) != (i > *max_width))
        {
            result = CYHAL_QSPI_RSLT_ERR_PIN;
        }
    }

    return result;
}

/* Based on ssel pin chosen, determines SMIF slave select parameter and pin mapping */
static const cyhal_resource_pin_mapping_t *_cyhal_qspi_get_slaveselect(cyhal_gpio_t ssel, uint8_t *ssel_idx)
{
#if _CYHAL_QSPI_SEL1 || _CYHAL_QSPI_SEL2 || _CYHAL_QSPI_SEL3
    bool pin_found = false;
#endif
    const cyhal_resource_pin_mapping_t *pin_mapping = _CYHAL_UTILS_GET_RESOURCE(ssel, cyhal_pin_map_smif_spi_select0);
    if (NULL != pin_mapping)
    {
#if _CYHAL_QSPI_SEL1 || _CYHAL_QSPI_SEL2 || _CYHAL_QSPI_SEL3
        pin_found = true;
#endif
        /* Provided by user ssel is related to Slave # 0 */
        *ssel_idx = 0;
    }
#if _CYHAL_QSPI_SEL1
    if (!pin_found)
    {
        pin_mapping = _CYHAL_UTILS_GET_RESOURCE(ssel, cyhal_pin_map_smif_spi_select1);
        if (NULL != pin_mapping)
        {
            pin_found = true;
            /* Provided by user ssel is related to Slave # 1 */
            *ssel_idx = 1;
        }
    }
#endif
#if _CYHAL_QSPI_SEL2
    if (!pin_found)
    {
        pin_mapping = _CYHAL_UTILS_GET_RESOURCE(ssel, cyhal_pin_map_smif_spi_select2);
        if (NULL != pin_mapping)
        {
            pin_found = true;
            /* Provided by user ssel is related to Slave # 2 */
            *ssel_idx = 2;
        }
    }
#endif
#if _CYHAL_QSPI_SEL3
    if (!pin_found)
    {
        pin_mapping = _CYHAL_UTILS_GET_RESOURCE(ssel, cyhal_pin_map_smif_spi_select3);
        if (NULL != pin_mapping)
        {
            pin_found = true;
            /* Provided by user ssel is related to Slave # 3 */
            *ssel_idx = 3;
        }
    }
#endif

    return pin_mapping;
}

/* Based on data pins chosen, determines SMIF data select parameter */
static const cyhal_resource_pin_mapping_t *_cyhal_qspi_get_dataselect(cyhal_gpio_t io0, cy_en_smif_data_select_t *data_select, uint8_t *offset)
{
    bool pin_found = false;
    const cyhal_resource_pin_mapping_t *pin_mapping = _CYHAL_UTILS_GET_RESOURCE(io0, cyhal_pin_map_smif_spi_data0);
    if (NULL != pin_mapping)
    {
        pin_found = true;
        *data_select = CY_SMIF_DATA_SEL0;
        *offset = 0;
    }
    if (!pin_found)
    {
        pin_mapping = _CYHAL_UTILS_GET_RESOURCE(io0, cyhal_pin_map_smif_spi_data2);
        if (NULL != pin_mapping)
        {
            pin_found = true;
            *data_select = CY_SMIF_DATA_SEL1;
            *offset = 2;
        }
    }
#if _CYHAL_QSPI_DATA8_PRESENT
    if (!pin_found)
    {
        pin_mapping = _CYHAL_UTILS_GET_RESOURCE(io0, cyhal_pin_map_smif_spi_data4);
        if (NULL != pin_mapping)
        {
            pin_found = true;
            *data_select = CY_SMIF_DATA_SEL2;
            *offset = 4;
        }
    }
    if (!pin_found)
    {
        pin_mapping = _CYHAL_UTILS_GET_RESOURCE(io0, cyhal_pin_map_smif_spi_data6);
        if (NULL != pin_mapping)
        {
            pin_found = true;
            *data_select = CY_SMIF_DATA_SEL3;
            *offset = 6;
        }
    }
#endif
    return pin_mapping;
}

