RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_qspi.c
/*******************************************************************************
*       Functions
*******************************************************************************/

static cy_rslt_t _cyhal_qspi_slave_select_check_reserve(cyhal_qspi_t *obj, cyhal_gpio_t ssel, uint8_t *found_idx,
                                                        bool reserve_n_connect)
{
    CY_ASSERT(NULL != obj);
    const cyhal_resource_pin_mapping_t *ssel_map = _cyhal_qspi_get_slaveselect(ssel, found_idx);
    const cyhal_resource_pin_mapping_t *sclk_map = _CYHAL_UTILS_GET_RESOURCE(obj->pin_sclk, cyhal_pin_map_smif_spi_clk);
    /* Found ssel map is not null and belong to same block as sclk */
    if ((NULL == ssel_map) || (NULL == sclk_map) || !_cyhal_utils_map_resources_equal(sclk_map, ssel_map))
    {
        return CYHAL_QSPI_RSLT_ERR_CANNOT_CONFIG_SSEL;
    }
    /* Specified SSEL is already configured, nothing to do. */
    if (NC != obj->pin_ssel[*found_idx])
    {
        return CY_RSLT_SUCCESS;
    }
    /* No problems with pins, proceeding to reservation if reserve_n_connect is true */
    /* If reserve_n_connect is false, it is assumed that pins are reserved and initialized by configurator - generated
    *   code */
    cy_rslt_t result = reserve_n_connect
        ? _cyhal_qspi_check_pin_and_reserve(ssel_map, CYHAL_PIN_MAP_DRIVE_MODE_SMIF_SPI_SELECT0)
        : CY_RSLT_SUCCESS;
    if (CY_RSLT_SUCCESS == result)
    {
        obj->pin_ssel[*found_idx] = ssel;
    }
    return result;
}

/* Checks that provided pins are correct, store them in the object and return data select */
static cy_rslt_t _cyhal_qspi_process_pin_set(cyhal_qspi_t *obj, const cyhal_qspi_slave_pin_config_t *pin_set,
    cy_en_smif_data_select_t *data_select, uint8_t *found_ssel_idx, bool reserve_n_connect)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != pin_set);

    cyhal_qspi_bus_width_t max_width;
    cy_rslt_t result = _cyhal_qspi_check_user_pins(pin_set, &max_width);

    uint8_t pin_offset = 0;
    const cyhal_resource_pin_mapping_t *sclk_map = _CYHAL_UTILS_GET_RESOURCE(obj->pin_sclk, cyhal_pin_map_smif_spi_clk);
    const cyhal_resource_pin_mapping_t *io_maps[_CYHAL_QSPI_MAX_DATA_PINS] = { NULL };
    const size_t data_pin_map_sizes[_CYHAL_QSPI_MAX_DATA_PINS - 1] = // Must compute sizes here since we can't get them from the map pointers
    {
        sizeof(cyhal_pin_map_smif_spi_data1) / sizeof(cyhal_resource_pin_mapping_t),
        sizeof(cyhal_pin_map_smif_spi_data2) / sizeof(cyhal_resource_pin_mapping_t),
        sizeof(cyhal_pin_map_smif_spi_data3) / sizeof(cyhal_resource_pin_mapping_t),
#if _CYHAL_QSPI_DATA8_PRESENT
        sizeof(cyhal_pin_map_smif_spi_data4) / sizeof(cyhal_resource_pin_mapping_t),
        sizeof(cyhal_pin_map_smif_spi_data5) / sizeof(cyhal_resource_pin_mapping_t),
        sizeof(cyhal_pin_map_smif_spi_data6) / sizeof(cyhal_resource_pin_mapping_t),
        sizeof(cyhal_pin_map_smif_spi_data7) / sizeof(cyhal_resource_pin_mapping_t),
#endif
    };
    const cyhal_resource_pin_mapping_t *data_pin_maps[_CYHAL_QSPI_MAX_DATA_PINS - 1] = // Not used to get the map for data pin 0
    {
        cyhal_pin_map_smif_spi_data1,
        cyhal_pin_map_smif_spi_data2,
        cyhal_pin_map_smif_spi_data3,
#if _CYHAL_QSPI_DATA8_PRESENT
        cyhal_pin_map_smif_spi_data4,
        cyhal_pin_map_smif_spi_data5,
        cyhal_pin_map_smif_spi_data6,
        cyhal_pin_map_smif_spi_data7,
#endif
    };

    if (CY_RSLT_SUCCESS == result)
    {
        const cyhal_resource_pin_mapping_t *tmp_io_map =
                _cyhal_qspi_get_dataselect(pin_set->io[0], data_select, &pin_offset);
        io_maps[pin_offset] = tmp_io_map;
        if (NULL == sclk_map || NULL == io_maps[pin_offset] ||
            !_cyhal_utils_map_resources_equal(sclk_map, io_maps[pin_offset]))
        {
            result = CYHAL_QSPI_RSLT_ERR_PIN;
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        /* DATA_SEL 1 and DATA_SEL 3 are illegal when using Quad SPI
        *  DATA SEL 1, DATA SEL 2 and DATA SEL 3 are illegal when using Octal SPI */
        if (((CYHAL_QSPI_CFG_BUS_QUAD == max_width) &&
                ((CY_SMIF_DATA_SEL1 == *data_select) || (CY_SMIF_DATA_SEL3 == *data_select))) ||
            ((CYHAL_QSPI_CFG_BUS_OCTAL == max_width) && (*data_select >= CY_SMIF_DATA_SEL1)))
        {
            result = CYHAL_QSPI_RSLT_ERR_DATA_SEL;
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        /* Check that all data pins (but not the first one, which is covered already) are valid and belong
        *  to same instance */
        for (uint8_t i = pin_offset + 1; i < pin_offset + max_width; i++)
        {
            io_maps[i] = _cyhal_utils_get_resource(pin_set->io[i-pin_offset], data_pin_maps[i-1], data_pin_map_sizes[i-1],
                                NULL, false);
            if (NULL == io_maps[i] || !_cyhal_utils_map_resources_equal(sclk_map, io_maps[i]))
            {
                result = CYHAL_QSPI_RSLT_ERR_PIN;
                break;
            }
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_qspi_slave_select_check_reserve(obj, pin_set->ssel, found_ssel_idx, reserve_n_connect);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        /* reserve the io pins */
        for (uint8_t i = pin_offset; (i < pin_offset + max_width) && (result == CY_RSLT_SUCCESS); i++)
        {
            if ((NC != pin_set->io[i-pin_offset]) && (NC == obj->pin_io[i]))
            {
                if (reserve_n_connect)
                {
                    result = _cyhal_qspi_check_pin_and_reserve(io_maps[i], CYHAL_PIN_MAP_DRIVE_MODE_SMIF_SPI_DATA0);
                }
                if (CY_RSLT_SUCCESS == result)
                {
                    obj->pin_io[i] = pin_set->io[i-pin_offset];
                }
            }
        }
    }

    return result;
}


static cy_rslt_t _cyhal_qspi_init_common(cyhal_qspi_t *obj, const cyhal_qspi_configurator_t *cfg, uint32_t hz)
{
    /* Explicitly marked not allocated resources as invalid to prevent freeing them. */
    memset(obj, 0, sizeof(cyhal_qspi_t));
    obj->resource.type = CYHAL_RSC_INVALID;
    obj->is_clock_owned = false;

    obj->dc_configured = (NULL != cfg->resource);
    if ((obj->dc_configured) &&
        (cfg->config->mode != CY_SMIF_NORMAL ||
        /* Bits representation of interrupts (msb to lsb):
            _MEMORY_MODE_ALIGMENT_ERROR, _RX_DATA_FIFO_UNDERFLOW, _TX_COMMAND_FIFO_OVERFLOW, _TX_DATA_FIFO_OVERFLOW,
            _RX_FIFO_TRIGEER_LEVEL, _TX_FIFO_TRIGEER_LEVEL */
        ((cfg->irqs & 0x3F) != 0) ||
        /* Bits representation of activated DMA outputs (msb to lsb):
            _RX_DMA_TRIGGER_OUT_USED, _TX_DMA_TRIGGER_OUT_USED */
        (cfg->dmas & 0x3) != 0))
    {
        /* List of SMIF personality items, which are currently not supported in QSPI HAL driver:
            - XIP (eXecute In Place) mode
            - Memory Mode Alignment Error interrupt
            - RX Data FIFO Underflow interrupt
            - TX Command FIFO Overflow
            - TX Data FIFO Overflow interrupt
            - RX FIFO Level Trigger interrupt
            - TX FIFO Level Trigger interrupt
            - RX DMA Trigger
            - TX DMA Trigger
        */
        return CYHAL_QSPI_RSLT_ERR_UNSUPPORTED;
    }

    cyhal_gpio_t ssel = NC;
    size_t found_ssel_idx_cfg = 0;
    for (size_t ssel_idx = 0; ssel_idx < sizeof(cfg->gpios.ssel) / sizeof(cfg->gpios.ssel[0]); ++ssel_idx)
    {
        if (NC != cfg->gpios.ssel[ssel_idx])
        {
            ssel = cfg->gpios.ssel[ssel_idx];
            found_ssel_idx_cfg = ssel_idx;
            break;
        }
    }

    cy_rslt_t result = CY_RSLT_SUCCESS;
    const cyhal_resource_pin_mapping_t *sclk_map = _CYHAL_UTILS_GET_RESOURCE(cfg->gpios.sclk, cyhal_pin_map_smif_spi_clk);
    /* Can't work without sclk pin */
    if (NULL == sclk_map)
    {
        result = CYHAL_QSPI_RSLT_ERR_PIN;
    }
    if ((CY_RSLT_SUCCESS == result) && (false == obj->dc_configured))
    {
        result = _cyhal_qspi_check_pin_and_reserve(sclk_map, CYHAL_PIN_MAP_DRIVE_MODE_SMIF_SPI_CLK);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        obj->pin_sclk = cfg->gpios.sclk;

        for (size_t i = 0; i < SMIF_CHIP_TOP_SPI_SEL_NR; ++i)
        {
            obj->pin_ssel[i] = NC;
        }
        for (size_t i = 0; i < _CYHAL_QSPI_MAX_DATA_PINS; ++i)
        {
            obj->pin_io[i] = NC;
        }
    }

    cy_en_smif_data_select_t data_select;
    uint8_t found_ssel_idx;

    cyhal_qspi_slave_pin_config_t pin_set;
    pin_set.ssel = ssel;
    memcpy(pin_set.io, cfg->gpios.io, sizeof(cfg->gpios.io));

    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_qspi_process_pin_set(obj, &pin_set, &data_select, &found_ssel_idx, !obj->dc_configured);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        if (obj->dc_configured)
        {
            obj->resource = *cfg->resource;
        }
        else
        {
            cyhal_resource_inst_t rsc = { CYHAL_RSC_SMIF, sclk_map->block_num, sclk_map->channel_num };
        #ifndef __MBED__
            // Mbed calls qspi_init multiple times without calling qspi_free to update the QSPI frequency/mode.
            // As a result, we won't worry about resource reservation if running through mbed.
            result = cyhal_hwmgr_reserve(&rsc);
            if (CY_RSLT_SUCCESS == result)
        #endif
            {
                obj->resource = rsc;
            }
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        obj->base = _cyhal_qspi_base_addresses[obj->resource.block_num];
    }

    if (CY_RSLT_SUCCESS == result)
    {
        if (NULL != cfg->clock)
        {
            /* Clock is provided by configuration */
            if (cfg->clock->block == CYHAL_CLOCK_BLOCK_HF)
            {
                obj->clock = *cfg->clock;
                /* obj->is_clock_owned is false already, so no need to assign it */
            }
            else
            {
                /* Incorrect shared clock was provided by user. */
                result = CYHAL_QSPI_RSLT_ERR_CLOCK;
            }
        }
        else
        {
            /* No clock was provided by configuration, so allocating it */

            // The hardware is generally going to be hardwired to an hfclk, which has very limited divider options. In the event
            // that we're hooked up a PERI divider, we don't have any particular expectations about its width - so just ask for 8-bit
            result = _cyhal_utils_allocate_clock(&(obj->clock), &(obj->resource), CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT, true);
            obj->is_clock_owned = (result == CY_RSLT_SUCCESS);
        }
    }

    if (obj->is_clock_owned)
    {
        if (CY_RSLT_SUCCESS == result)
        {
            result = cyhal_qspi_set_frequency(obj, hz);
        }

        if (CY_RSLT_SUCCESS == result)
        {
            result = cyhal_clock_set_enabled(&(obj->clock), true, true);
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = (cy_rslt_t) Cy_SMIF_Init(obj->base, cfg->config, _CYHAL_QSPI_TIMEOUT_10_MS, &obj->context);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        /* Configure first SSEL, that was found in cfg->gpios and make it active */
        obj->slave_select = _cyhal_qspi_slave_idx_to_smif_ss(found_ssel_idx);
        Cy_SMIF_SetDataSelect(obj->base, obj->slave_select, data_select);

        /* found_ssel_idx_cfg and below are already processed, no reason to start from index #0 */
        size_t ssel_idx = found_ssel_idx_cfg;
        /* Process rest of ssel, that are provided by cfg->gpios */
        while ((CY_RSLT_SUCCESS == result) && ((ssel_idx + 1) < (sizeof(cfg->gpios.ssel) / sizeof(cfg->gpios.ssel[0]))))
        {
            ++ssel_idx;
            if (NC != cfg->gpios.ssel[ssel_idx])
            {
                pin_set.ssel = cfg->gpios.ssel[ssel_idx];
                result = _cyhal_qspi_process_pin_set(obj, &pin_set, &data_select, &found_ssel_idx, !obj->dc_configured);
                if (result == CY_RSLT_SUCCESS)
                {
                    Cy_SMIF_SetDataSelect(obj->base, _cyhal_qspi_slave_idx_to_smif_ss(found_ssel_idx), data_select);
                }
            }
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        Cy_SMIF_Enable(obj->base, &obj->context);

        obj->callback_data.callback = NULL;
        obj->callback_data.callback_arg = NULL;
        obj->irq_cause = CYHAL_QSPI_EVENT_NONE;
        _cyhal_qspi_config_structs[obj->resource.block_num] = obj;
        obj->pm_transition_pending = false;
        obj->pm_callback.callback = &_cyhal_qspi_pm_callback;
        obj->pm_callback.states = (cyhal_syspm_callback_state_t)(CYHAL_SYSPM_CB_CPU_DEEPSLEEP | CYHAL_SYSPM_CB_SYSTEM_HIBERNATE);
        obj->pm_callback.args = obj;
        obj->pm_callback.next = NULL;
        obj->pm_callback.ignore_modes = CYHAL_SYSPM_AFTER_DS_WFI_TRANSITION;
        _cyhal_syspm_register_peripheral_callback(&(obj->pm_callback));

