RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_qspi.c
        _cyhal_irq_register(_CYHAL_QSPI_IRQ_N[obj->resource.block_num], CYHAL_ISR_PRIORITY_DEFAULT, _cyhal_qspi_irq_handler);
        _cyhal_irq_enable(_CYHAL_QSPI_IRQ_N[obj->resource.block_num]);
    }

    if (CY_RSLT_SUCCESS != result)
    {
        cyhal_qspi_free(obj);
    }

    return result;
}

cy_rslt_t cyhal_qspi_init(
    cyhal_qspi_t *obj, cyhal_gpio_t sclk, const cyhal_qspi_slave_pin_config_t *pin_set, uint32_t hz, uint8_t mode,
    cyhal_clock_t *clk)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != pin_set);

    /* mode (CPOL and CPHA) are not supported in CAT1 (PSoCâ„¢ 6) */
    CY_UNUSED_PARAMETER(mode);

#if defined(CY_DEVICE_CYW20829)
    if (NULL == clk)
    {
        /* Only user-provided clock is supported by 20829 QSPI. Please refer to device-specific
            "section_hal_impl_qspi_init_clock_20829" documentation section for details. */

        return CYHAL_QSPI_RSLT_ERR_UNSUPPORTED;
    }
#endif /* defined(CY_DEVICE_CYW20829) */

    /* Default QSPI configuration */
    const cy_stc_smif_config_t config =
    {
        .mode = (uint32_t)CY_SMIF_NORMAL,
        .deselectDelay = _CYHAL_QSPI_DESELECT_DELAY,
#if (CY_IP_MXSMIF_VERSION >= 2)
        .rxClockSel = (uint32_t)CY_SMIF_SEL_INVERTED_FEEDBACK_CLK,
#else
        .rxClockSel = (uint32_t)CY_SMIF_SEL_INV_INTERNAL_CLK,
#endif
        .blockEvent = (uint32_t)CY_SMIF_BUS_ERROR,
    };

    const cyhal_qspi_configurator_t cfg = {
        .resource = NULL,
        .config = &config,
        .clock = clk,
        .gpios = {
            .sclk = sclk,
            .ssel = { pin_set->ssel, NC, NC, NC },
            .io = { pin_set->io[0], pin_set->io[1], pin_set->io[2], pin_set->io[3],
                    pin_set->io[4], pin_set->io[5], pin_set->io[6], pin_set->io[7] }
        },
        .irqs = 0u,
        .dmas = 0u
    };

    return _cyhal_qspi_init_common(obj, &cfg, hz);
}

cy_rslt_t cyhal_qspi_init_cfg(cyhal_qspi_t *obj, const cyhal_qspi_configurator_t *cfg)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != cfg);
    CY_ASSERT(NULL != cfg->config);

    /* Frequency parameter is ignored when clock is provided (configurator flow, cyhal_qspi_init_cfg function) */
    return _cyhal_qspi_init_common(obj, cfg, 0);
}

void cyhal_qspi_free(cyhal_qspi_t *obj)
{
    if (CYHAL_RSC_SMIF == obj->resource.type)
    {
        _cyhal_system_irq_t irqn = _CYHAL_QSPI_IRQ_N[obj->resource.block_num];
        _cyhal_irq_free(irqn);
        _cyhal_syspm_unregister_peripheral_callback(&(obj->pm_callback));
        if (obj->base != NULL)
        {
            Cy_SMIF_Disable(obj->base);
            Cy_SMIF_DeInit(obj->base);
            obj->base = NULL;
        }
        if (!obj->dc_configured)
        {
            cyhal_hwmgr_free(&(obj->resource));
        }
        obj->resource.type = CYHAL_RSC_INVALID;
    }

    if (!obj->dc_configured)
    {
        _cyhal_utils_release_if_used(&(obj->pin_sclk));
        for (uint8_t i = 0; i < SMIF_CHIP_TOP_SPI_SEL_NR; i++)
        {
            _cyhal_utils_release_if_used(&(obj->pin_ssel[i]));
        }
        for (uint8_t i = 0; (i < _CYHAL_QSPI_MAX_DATA_PINS); i++)
        {
            _cyhal_utils_release_if_used(&(obj->pin_io[i]));
        }
    }

    if (obj->is_clock_owned)
    {
        cyhal_clock_free(&(obj->clock));
        obj->is_clock_owned = false;
    }
}

cy_rslt_t cyhal_qspi_set_frequency(cyhal_qspi_t *obj, uint32_t hz)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(hz != 0);

    if (obj->is_clock_owned)
    {
        const cyhal_clock_tolerance_t tolerance = { CYHAL_TOLERANCE_PERCENT, 10 };
#if (CY_IP_MXSMIF_VERSION >= 2)
        /* SMIF ver. 2 and further divides source clock by 2 internally, so we need to request 2 times more.
         * Please refer to `section_hal_impl_clock_freq` implementation-specific documentation for details.
        */
        hz <<= 1;
#endif /*  */
        return _cyhal_utils_set_clock_frequency2(&(obj->clock), hz, &tolerance);
    }
    else
    {
        /* In case of pre-configured clock, user application is responsible for configuring QSPI bus frequency.
        *  For all currently supported by this driver devices, output QSPI bus frequency is equal to frequency
        *  of provided HF clock. */
        return CYHAL_QSPI_RSLT_ERR_CLOCK;
    }
}

uint32_t cyhal_qspi_get_frequency(cyhal_qspi_t *obj)
{
    CY_ASSERT(NULL != obj);
    uint32_t freq = cyhal_clock_get_frequency(&(obj->clock));
#if (CY_IP_MXSMIF_VERSION >= 2)
    /* Please refer to `section_hal_impl_clock_freq` implementation-specific documentation for details. */
    return freq / 2;
#else
    return freq;
#endif /* (CY_IP_MXSMIF_VERSION >= 2) or other */
}

cy_rslt_t cyhal_qspi_slave_configure(cyhal_qspi_t *obj, const cyhal_qspi_slave_pin_config_t *pin_set)
{
    CY_ASSERT(NULL != obj);
    uint8_t ssel_idx = 0;
    cy_en_smif_data_select_t data_select;
    cy_rslt_t result = _cyhal_qspi_process_pin_set(obj, pin_set, &data_select, &ssel_idx, true);
    if (CY_RSLT_SUCCESS == result)
    {
        Cy_SMIF_SetDataSelect(obj->base, _cyhal_qspi_slave_idx_to_smif_ss(ssel_idx), data_select);
    }
    return result;
}

cy_rslt_t cyhal_qspi_select_active_ssel(cyhal_qspi_t *obj, cyhal_gpio_t ssel)
{
    CY_ASSERT(NULL != obj);
    for (uint8_t ssel_idx = 0; ssel_idx < SMIF_CHIP_TOP_SPI_SEL_NR; ssel_idx++)
    {
        if (ssel == obj->pin_ssel[ssel_idx])
        {
            obj->slave_select = _cyhal_qspi_slave_idx_to_smif_ss(ssel_idx);
            return CY_RSLT_SUCCESS;
        }
    }
    return CYHAL_QSPI_RSLT_ERR_CANNOT_SWITCH_SSEL;
}

static cy_rslt_t _cyhal_qspi_wait_for_cmd_fifo(cyhal_qspi_t *obj)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;
    uint32_t timeout = _CYHAL_QSPI_TIMEOUT_10_MS;
    while ((Cy_SMIF_GetCmdFifoStatus(obj->base) == CY_SMIF_TX_CMD_FIFO_STATUS_RANGE) &&
                    (CY_RSLT_SUCCESS == status))
    {
        /* Waiting for 1 us per iteration */
        Cy_SysLib_DelayUs(1);
        --timeout;
        status = (0u == timeout)? CYHAL_QSPI_RSLT_ERR_TIMEOUT: CY_RSLT_SUCCESS;
    }
    return status;
}

/* no restriction on the value of length. This function splits the read into multiple chunked transfers. */
cy_rslt_t cyhal_qspi_read(cyhal_qspi_t *obj, const cyhal_qspi_command_t *command, uint32_t address, void *data, size_t *length)
{
    if (obj->pm_transition_pending)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    cy_rslt_t status = CY_RSLT_SUCCESS;
    uint32_t chunk = 0;
    size_t read_bytes = *length;

