RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_qspi.c
    /* SMIF can read only up to 65536 bytes in one go. Split the larger read into multiple chunks */
    while (read_bytes > 0)
    {
        chunk = (read_bytes > _CYHAL_QSPI_MAX_RX_COUNT) ? (_CYHAL_QSPI_MAX_RX_COUNT) : read_bytes;

        status = _cyhal_qspi_command_transfer(obj, command, address, false);

        if (CY_RSLT_SUCCESS == status)
        {
            if (command->dummy_cycles.dummy_count > 0u)
            {
                status = _cyhal_qspi_wait_for_cmd_fifo(obj);
                if (CY_RSLT_SUCCESS == status)
                {
                    #if (CY_IP_MXSMIF_VERSION < 3)
                    status = (cy_rslt_t)Cy_SMIF_SendDummyCycles(obj->base, command->dummy_cycles.dummy_count);
                    #else
                    status = (cy_rslt_t)Cy_SMIF_SendDummyCycles_Ext(obj->base,
                            _cyhal_qspi_convert_bus_width(command->dummy_cycles.bus_width),
                            (cy_en_smif_data_rate_t)command->dummy_cycles.data_rate, command->dummy_cycles.dummy_count);
                    #endif /* CY_IP_MXSMIF_VERSION < 3 or other */
                }
            }

            if (CY_RSLT_SUCCESS == status)
            {
                status = _cyhal_qspi_wait_for_cmd_fifo(obj);
                if (CY_RSLT_SUCCESS == status)
                {
                    #if (CY_IP_MXSMIF_VERSION < 3)
                    status = (cy_rslt_t)Cy_SMIF_ReceiveDataBlocking(obj->base, (uint8_t *)data, chunk,
                        _cyhal_qspi_convert_bus_width(command->data.bus_width), &obj->context);
                    #else
                    status = (cy_rslt_t)Cy_SMIF_ReceiveDataBlocking_Ext(obj->base, (uint8_t *)data, chunk,
                        _cyhal_qspi_convert_bus_width(command->data.bus_width),
                        (cy_en_smif_data_rate_t)command->data.data_rate, &obj->context);
                    #endif /* CY_IP_MXSMIF_VERSION < 3 or other */
                    if (CY_RSLT_SUCCESS != status)
                    {
                        break;
                    }
                }
            }
        }
        read_bytes -= chunk;
        address += chunk;
        data = (uint8_t *)data + chunk;
    }

    return status;
}

cy_rslt_t cyhal_qspi_read_async(cyhal_qspi_t *obj, const cyhal_qspi_command_t *command, uint32_t address, void *data, size_t *length)
{
    if (obj->pm_transition_pending)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    cy_rslt_t status = _cyhal_qspi_command_transfer(obj, command, address, false);

    if (CY_RSLT_SUCCESS == status)
    {
        if (command->dummy_cycles.dummy_count > 0u)
        {
            status = _cyhal_qspi_wait_for_cmd_fifo(obj);
            if (CY_RSLT_SUCCESS == status)
            {
                #if (CY_IP_MXSMIF_VERSION < 3)
                status = (cy_rslt_t)Cy_SMIF_SendDummyCycles(obj->base, command->dummy_cycles.dummy_count);
                #else
                status = (cy_rslt_t)Cy_SMIF_SendDummyCycles_Ext(obj->base,
                        _cyhal_qspi_convert_bus_width(command->dummy_cycles.bus_width),
                        (cy_en_smif_data_rate_t)command->dummy_cycles.data_rate, command->dummy_cycles.dummy_count);
                #endif /* CY_IP_MXSMIF_VERSION < 3 or other */
            }
        }

        if (CY_RSLT_SUCCESS == status)
        {
            status = _cyhal_qspi_wait_for_cmd_fifo(obj);
            if (CY_RSLT_SUCCESS == status)
            {
                #if (CY_IP_MXSMIF_VERSION < 3)
                status = (cy_rslt_t)Cy_SMIF_ReceiveData(obj->base, (uint8_t *)data, (uint32_t)*length,
                    _cyhal_qspi_convert_bus_width(command->data.bus_width), _cyhal_qspi_cb_wrapper, &obj->context);
                #else
                status = (cy_rslt_t)Cy_SMIF_ReceiveData_Ext(obj->base, (uint8_t *)data, (uint32_t)*length,
                    _cyhal_qspi_convert_bus_width(command->data.bus_width),
                    (cy_en_smif_data_rate_t)command->data.data_rate, _cyhal_qspi_cb_wrapper, &obj->context);
                #endif /* CY_IP_MXSMIF_VERSION < 3 or other */
            }
        }
    }
    return status;
}

/* length can be up to 65536. */
cy_rslt_t cyhal_qspi_write(cyhal_qspi_t *obj, const cyhal_qspi_command_t *command, uint32_t address, const void *data,
        size_t *length)
{
    if (obj->pm_transition_pending)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    cy_rslt_t status = _cyhal_qspi_command_transfer(obj, command, address, false);

    if (CY_RSLT_SUCCESS == status)
    {
        if (command->dummy_cycles.dummy_count > 0u)
        {
            status = _cyhal_qspi_wait_for_cmd_fifo(obj);
            if (CY_RSLT_SUCCESS == status)
            {
                #if (CY_IP_MXSMIF_VERSION < 3)
                status = (cy_rslt_t)Cy_SMIF_SendDummyCycles(obj->base, command->dummy_cycles.dummy_count);
                #else
                status = (cy_rslt_t)Cy_SMIF_SendDummyCycles_Ext(obj->base,
                        _cyhal_qspi_convert_bus_width(command->dummy_cycles.bus_width),
                        (cy_en_smif_data_rate_t)command->dummy_cycles.data_rate, command->dummy_cycles.dummy_count);
                #endif /* CY_IP_MXSMIF_VERSION < 3 or other */
            }
        }

        if ((CY_SMIF_SUCCESS == status) && (*length > 0))
        {
            status = _cyhal_qspi_wait_for_cmd_fifo(obj);
            if (CY_RSLT_SUCCESS == status)
            {
                #if (CY_IP_MXSMIF_VERSION < 3)
                status = (cy_rslt_t)Cy_SMIF_TransmitDataBlocking(obj->base, (uint8_t *)data, *length,
                    _cyhal_qspi_convert_bus_width(command->data.bus_width), &obj->context);
                #else
                status = (cy_rslt_t)Cy_SMIF_TransmitDataBlocking_Ext(obj->base, (uint8_t *)data, *length,
                    _cyhal_qspi_convert_bus_width(command->data.bus_width),
                    (cy_en_smif_data_rate_t)command->data.data_rate, &obj->context);
                #endif /* CY_IP_MXSMIF_VERSION < 3 or other */
            }
        }
    }

